#pragma once
#include <WinSock2.h>
#include <WS2tcpip.h>
#include<iostream>

#pragma comment(lib, "ws2_32.lib")  //加载 ws2_32.dll

/*---------------------------------------------------------------------------
** 类名 : Client
**---------------------------------------------------------------------------
** 功能 : 客户端
**---------------------------------------------------------------------------
** Date			Name
** 2019.02.11	任伟
**---------------------------------------------------------------------------*/
class Client
{
public:

	// 初始化
	Client();

	// 释放
	~Client();

	// 开启网络服务
	bool StartNetService();
};

