#pragma once
#include <winsock2.h>
#include <iostream>

#pragma comment(lib, "ws2_32.lib")  //加载 ws2_32.dll

/*---------------------------------------------------------------------------
** 类名 : SubServer
**---------------------------------------------------------------------------
** 功能 : 子服务器
**---------------------------------------------------------------------------
** Date			Name
** 2018.02.06	任伟
**---------------------------------------------------------------------------*/
class SubServer
{
public:

	// 初始化
	SubServer();

	// 释放
	~SubServer();

	// 初始化网络服务
	bool InitNetService();

	// 初始化套接字
	int InitSocket();

	// 处理客户端请求
	bool DealNetRequest(int iServerfd);

};

